{"filename": "Candidate3-AWS_Data", "pages": [{"page_n": "1", "p_content": " Daniel C. Doran   Mobile  07980894462 Page 1 of 5  Personal Information Full name:                      Daniel C. Doran , M.Sc. Computer Science, B.Sc. Engineering Address:  23 Hawthorn Grove    Bath    BA2 5QA Telephone:  07980894462 e-mail address  40theridgeway@gmail.com Nationality:  British  Summary of Relevant Skills and Experience Management ● Managing multi-skill development teams containing developers, BA’s  , architects and operations. Teams sizes from 5 to 30  -(10 years) ● Project management for cloud and enterprise systems ● Experience ( 10 years) managing outsourced teams in Hungary and India  Architecture and Design ● Experience with TOGAF and Zachman framework ( 3 years) ● Use of Archimate in EA ● Modelling tools (UML) including IBM Rational Software Architect 7.5/8, Rational Team Concert: Work Items and workgroup under Jazz Server Administration and Setup of work streams, components and Configuration Management Strategy.  Implementing RUP in an organisation ● Enterprise, Solution and Technical Architecture from inception to delivery. patterns and Framework adoption. ● SOA architectures: SOAP/REST Web services through MS Web Services WCF, BizTalk 2002., Mule ESB, Camel, ActiveMQ  BPM (Business Process Modelling) ● Data Modelling: Erwin 6/78 Modeller and Oracle Designer Microsoft SQL Server 2012, 2008 (R2), 2005, 2000, 7, 6.5 and 4 development SSIS (DTS packages) SSRS reporting (T/SQL, Stored Procedures), SSAS Data warehousing, cubes and dimensions. ● Prince 1 qualified ● Design for AWS and Microsoft Azure cloud systems.  Application Development ● Coordinating and tracking releases in “Continuous Release” environment ● Implemented “Continuous release” processes and technical framework ● Experience with web and native application for Android and IOS mobile platforms ● Experience with Java,Perl,.Net in web projects, Python, Ruby ● Very strong Agile/Scrum  experience over last 8 years   ● Extensive experience in TDD (Test Driven Development) using NUnit, SpecFlow, Gallio/MBUnit, Cucumber etc. ● Extensive experience implementing Continuous Integration (CI) and Continuous Deployment systems used as basis of DevOps (6 years)      \f"}, {"page_n": "2", "p_content": " Daniel C. Doran   Mobile  07980894462 Page 2 of 5  Software skills  Product Experience(years) Product Experience(years) AdxStudio from VisionWare 3 months Kubernetes 3 Android 3 MS Active Directory 15 Apache Spark 2 MS Powershell 2 ASP.Net 7 MS SCCOM (System Centre Configuration Manager) 1 AWS (Amazon Web Services) 4 MS SCOM (System Centre Operations Manager) 1 Azure 4 MS SCORCH ( System Centre Orchestrator) 1 C 7 MSMQ messaging 5 C#/.Net 4.5 11 MultiVue Master Data Management 3 months C++ 5 PHP 2 Cassandra 2 Postgres 3 Chef 1 Puppet 1 Docker 3 Python 2 Erlang  1 Rabbit/Active MQ 1 F# 1 Swagger/RAML 4 GCP (Google Cloud Platform) 6 months Scala 1 Hadoop 3 SQL Server 2000/2005/2016 15 IBM MQ  1 Terraform 2 iOS 3 TSQL 10 Java 8 WCF 2 Kafka 2   \f"}, {"page_n": "3", "p_content": " Daniel C. Doran   Mobile  07980894462 Page 3 of 5  Employment History  Dec 12 2018 – August 2019 EPAM (http://www.epam.com ) Senior Architect ● Define and implement DevOps strategy using automate build and test and Continuous Delivery with TeamCity, AWS and Octopus Deploy, Kubernetes and AWS ● Produce POC for moving production systems to Docker/Kubernetes base ● Implement Docker/Kubernetes platform for testing in Ci/CD system ● Demonstrate, mentor and extend TDD/BDD testing and processes ● Participate in code reviews and “pull” requests ● Provide pre-sales support for re-platform of Excel application to web ● Install IAC (Infrastructure As Code) system using Terraform for non-production systems in AWS ● Introduce development teams to use SWAGGER ffor REST API’s  Oct 2017 – Nov 9th. 2018 Virtusa Polaris Chief Architect on DevOps/Cloud transformation in Lloyds Bank ● Manage creation of automated deployment using Urban Code Deploy, HPSA and Chef ● Provide technical and managerial guidance on TDD and “automated testing” ● Prioritise and schedule application moving to “IBM cloud” and Azure ● Negotiate above items with stakeholders. ● Discuss application design and propose changes to SME’s (Subject Matter Experts) on how to make application more “cloud native”  Jan 2016 – August 2017 Travel Stay Group (http://totalstaygroup.com/offices/ ) Senior Engineer/Solution Architect/Cloud migration ● Demonstrate and mentor use of TDD and BDD ● Create DevOps platform for on-premise,AWS and Azure infrastructure ● Create IAC system using AWS Cloudformation ● Create .NET development team ● Choose technology and processes to implement CD (Continuous Delivery) – Docker, Kubernetes,Terraform ● Implement BIg Data using Apache Spark and Hadoop as complement to existing SAP system ● Engage with senior stakeholders about release timing and content. ● Implement system in Amazon AWS and Azure  Aug 2015 – Dec 2015 Serco (at London Borough of Enfield) Solutions Architect ● Architecture around London Borough of Enfield digital and self-service strategy ● Implement MDM (Master Data Management) using Vision Ware MultiVue ● Define service contracts for integration of LOB (Line of Business) systems to “portal” ● Implement “portal” using Vision Ware AdxStudio based on MS Dynamics ● Amend design of MS CRM based on Microsoft Azure ● Integrate AWS based “Social Security” forms into LBE system running on Microsoft Azure  6 Jul 2015  To 7 Aug 2015 Atos  - http://uk.atos.net/en-uk/home.html  Solutions Architect  ● Assist in preparing bid for a £10 million for the RSP (Rail Settlement Plan)  ● Answer RFP questions ● Prepare architectural diagrams ● Negotiate  prices and delivery with suppliers  Nov 2013  To 27 March 2015 Valuation Office Agency  - https://www.gov.uk/government/organisations/valuation-office-agency  Solutions Architect/Cloud architect  ● Transfer “Housing Benefit” system from on premise to Microsoft Azure cloud ● Create client interaction system using Java and Amazon AWS ● Write outline system requirements , support  requirements for proposed SOA based BPM (Business Process Modelling) system ● Implemented a CD (Continuous Deployment) system based on the Microsoft Azure cloud platform. ● Managed implementation of a POC (Proof of Concept) fro Big Data using Apache Spark and Hadoop ● Managed enhancement of core “rent benefits” system which integrates a mapping system (GIS) , automated data delivery to local authorities and a rent evaluation process.   \f"}, {"page_n": "4", "p_content": " Daniel C. Doran   Mobile  07980894462 Page 4 of 5  ● Engage with stakeholders (business managers, operations, support, external consultancy, external suppliers, and security) to clarify functional, non-functional requirements, how to engage with suppliers, how suppliers will support their products and what security classifications are required for what data moving to multi-supplier environment. ● Investigate use of various mobile “geographic survey” devices based on native Android and iOS. ● Vendor selection, vendor scorecards  Jan 2013 To Sept 2013 Aircom International - http://www.teoco.com/  Solution Architect  ● Develop parallel integration and deployment systems using Jenkins and Amazon AWS ● Code reviews ensuring compliance with required standards ● Review architecture in view of compliance and non-functional requirements ● Code POC (Proof of Concept) for new of SOA features ● Review designs for handling large data/SCADA system (500gb./day) with 5000 concurrent users ● Provide service designs based on SOA architecture ( Mule ESB and Camel) ● Provide High Level Design of DR (Disaster Recovery) system ● Design SDLC process for dev,UAT and production ● Extend implementation of Continuous Integration System ● Design, develop  2 REST API’s  June 12 To Dec 12 Telegraph Media Group - http://www.telegraph.co.uk/topics/about-us/ Technical Architect, Telegraph Media Group                              ● Design integration platform for current digital asset platform and new one based on CMS standard ● Provide advertisement tracking system for web systems using Amazon AWS ● Model integration using TOGAF and Archimate ● Review of digital asset tracking system being developed in conjunction with St. Albans based company ● Size and document development, UAT and production systems for asset tracking ● Manage installation of “SAAS expenses” system ● Manage transfer of publishing system to German SaaS provider ● Design REST API for use by B2B users of digital asset tracking system. ● Commence redesign asset tracking system to run on Microsoft Azure  ● Provide buy/build costs on an external “digital commissioning” site ● System design for mobile (iOS, Android),tablet and desktop platforms ● Investigate/produce POC (Proof of Concept) for use of HTML5 as components of iOS/Android mobile platform to replace some of the native app. Parts. ● Design and implement “paywall” native interface for IOS and Android  Previous  roles – more detail provided on request   Working Links - http://www.workinglinks.co.uk/  Development Manager, Working Links    Jan 12 To April 12 201 Solution Architect , Vexed Digital  June 11 To Dec 11  Ofgem - https://www.ofgem.gov.uk/  Solution Architect Dec 09 To May 11  Manpower Software – Development Manager June 06 To Oct 08 Development manager/Software architect/project lead Retek Solutions Jan 01 To June 06 Project Manager/Architect, Mavicom Ltd (Permanent) Team leader with 4 reports : team size : 6                      Apr 00 – Dec 00 Senior Software engineer, NatWest PLC, Kings Cross                              Nov 99 – 10 Mar. 00 Project Leader, Equitas, Liverpool St.   Team leader with 6 reports : team size : 30                                                         Mar.99- 6 October 99 Senior AP/ Designer ,GlaxoWellcome - Stevenage                     Feb.98-Feb.99 Senior Analyst/Team Leader, Silverplatter Ltd. – London Team leader with 2 reports : team size : 4                      Feb.97 - Dec.97 Device driver writer, Memory Corporation                                              June.97 - Nov. 97 Device driver writer, Access Keyboards                                 Nov.96 - Jan. 97 Integrator/ Device Drivers, ICL . - Feltham                                        Aug.94 - Oct.96 \f"}, {"page_n": "5", "p_content": " Daniel C. Doran   Mobile  07980894462 Page 5 of 5  Team leader, Uniplex - Hemel Hempstead Team leader with 5 reports : team size : 30                                         Apr.94 - Aug 94 Senior Analyst/Programmer, Thorn/EMI - Hanwell,London                    July.93 - Feb.94 Senior Analyst/Programmer, D.P. Advisors - London                 Jan.93 - Jul.93   Professional Training   Course Name Date  Open University – knowledge engineering 1995  Open University – interface design 1994  Massey University New Zealand – Diploma Ergonomics 1990  Vax System Manager 1989  Prime System Manager course 1987  Structured Program Design 1984  Introduction to AOS(data General OS) 1981                     Education  Higher Education:  M.S.c Computer Science:  Queen’s University Belfast (1981) B.Sc  A-levels Queen’s University Belfast (1979) Math,Further Maths,Physics,Chemsitry                  Other Information I have good communication skills, across the board and have experience in dealing with multiple industries which I have worked in. I have management experience gained as an IT Director, Architect, Project Manager and Team Leader. Managing development teams and implementing process and standards. Complete extensive implementation through all project stages. Offshore development management, recruitment, integration, training and supervision.  I have a full Driving Licence     \f"}]}