{"filename": "Candidate4-AWS_Data", "pages": [{"page_n": "1", "p_content": "PAUL VENABLES Tel: +44 (0)7957 109123 Email: paul.venables@olisof.co.uk LinkedIn: https://uk.linkedin.com/in/paul-venables-a253067 Lead Data Architect & SME, Tech Project Manager, BI and Analytics, Kimball DW Techniques ASSET MANAGEMENT, INVESTMENT BANKING, OPEN BANKING, PAYMENTS, INSURANCE, TELCO, FINTECH  Page | 1  PROFILE\tSUMMARY\tØ Highly experienced Lead Enterprise Data Architect and Data SME with 20+ years providing services to major corporations Ø Strong financial business domain knowledge; asset management, regulatory, investment banking, open banking, insurance. Ø Strategic as well as Tech hands-on. Strong business stakeholder engagement skills , team leadership and technical project management. Ø Huge data architecture background. BI, Analytics, Lineage, Messaging, Machine Learning, Data Mining/Science, AWS and Azure Cloud. Ø Strong practitioner in Kimball Data Warehousing, ETL, modelling, governance, Master Data Management MDM, Reference and Market data Ø Strong practitioner in Sql Server, Oracle, Big Data, Pipelines, APIs, SQL, NOSQL, ML/AI/NLP/Python. Database Design for Performance. KEY ACHIEVEMENTS - Successfully acquired key design board approvals on a number of front/middle office solutions at ASI including fund structure data redesign - Headed Open Banking (startup) Data and API standards delivery for Phase 1-2 of Account Info and Payments solutions - Successful architecture/delivery of KYC/AML POC using AWS, Microservices and ML/NLP/AI for HSBC via Synechron under tight timescale - Successful architecture and delivery of cloud (AWS) based Qlikview data analytic and BI portal for Lloyds syndicates while meeting strict SLAs - Successful end-to-end strategy and delivery of global data warehouse and analytics system at Credit Suisse in Oracle, OBIEE and Hyperion - Directed and architected optimisation of massive Oracle data warehouse / mining application across the UBS investment bank for Compliance CERTIFICATIONS AND QUALIFICATIONS • TOGAF 9.1 Architecture • Machine Learning by Stanford University          • AWS Certified Solutions Architect Associate (SAAC01) • Markit EDM Core and UX (Enterprise Data Management)             • Agile Project Management by APMG • Prince2 by APMG       • BSc Computer Science (Hons) Degree PROFESSIONAL\tEXPERIENCE\tABERDEEN STANDARD INVESTMENTS (LONDON/EDINBURGH) SENIOR Enterprise Data Solutions Consultant - Front Office/Data Transformation Post Trade Match Settlement, Fixed Income & Global Loans, Derivatives, Regulatory Financial Services Technology Consulting Apr’18 to Oct’19  Major transformation programme merging Aberdeen and Standard Life fund and trading eco systems. Public Markets and Private Equity. • Headed trade match settlement (TM&S) migrations from BNP/State Street to CITI and consequent data system change required. • Responsible for new fund structure strategy and data model redesign to enable consistent models between merged legal entities • Azure Data Lake migrations. SQL Server, Power BI. ETL to IDW Kimball datawarehouse. Python. Kanban boards in Azure DevOps. • Modelling both operational data stores in Markit EDM and Kimball time series / SCD2 data warehouse for longer term stores and analytics • Responsible for Fund of Fund / Collectives (CIS) / Model Portfolio end-2-end ETL/msg solution migrating to CITI TPA and Calastone TA pricing • Responsible for Fixed Income Global Loans data migrations from Wall Street Office to CITI TPA from BNP/State Street. • Produced Global Shareholding Disclosure solution using RAPPTR third party cloud solution and AB INITIO data integration, metadata hub and governance components • Responsible for number of global regulatory solution papers to migrate to CITI Unavista model incl. EMIR, MIFID-II, FX and Options Reporting    • Key facilitator in Markit EDM, Charles River and ThinkFolio SQL Server based data solutions and SWIFT/XML messaging/data pipelining.  • Exchange Traded Derivatives ETD tech rework and Best Execution routing. Bloomberg per Security data feeds.  • Use of ServiceNow, UPM-x for architecture artefacts and SAP Power Designer for Data Models (conceptual, logical, physical)  SYNECHRON BUSINESS CONSULTING  Financial Services and IT Consulting DIRECTOR of Enterprise Data Architecture, Digital - AWS Cloud, API, Microservices Financial Services Technology Consulting Jan’18 – Apr’18 I led the architecture and delivery on the programme to provide an innovative KYC POC for HSBC using AWS Cloud. Data Analytics, GDPR, AWS Cloud, Data Pipelining/ETL, DevOps. We created a Chatbot feature using OCR, NLP and Machine Learning. API. Docker. Microservices. Spring/Java. Python Flask, PySpark. MongoDB/Aurora stores. XML/JSON. NO SQL / SQL. I also produced Big Data / Data Lake Strategy and Architecture bid papers for prospective clients. Produced RFIs/RFPs.  JUPITER ASSET MANAGEMENT (LONDON) SENIOR DATA Consultant - Markit EDM / Blackrock / Cash FX / MIFID-II Oct’17 – Jan’18 MIFID-II milestone consulting. SQL Server Master Data Management, C# coding and business analysis to meet some tight deadlines. OPEN BANKING IE LTD  (STARTUP IN LONDON) https://www.openbanking.org.uk/ HEAD of Data Standards and API Workstream, Data Architecture Owner – Data Modelling / Governance, PSD2, GDPR, API / XML /SWIFT / ISO-20022 / Payments / Oracle / AWS Cloud Nov’16 – Sep’17 HIGH PROFILE FCA / CMA MANDATE TO OPEN RETAIL AND BUSINESS BANK DATA PLUS PAYMENTS TO FINTECHS AND CONSUMERS. I managed a team of highly experienced solution architects, data architects and business analysts. § Provided Open Data APIs- ATM / Branch / Personal and Business Current Account / Commercial Credit Cards and Unsecured Loans § Provided Read-Write APIs - Account Info / Transaction Data / Payment Initiation § Worked with biggest retail banks in UK (CMA9) with FinTech community (third party providers). § Interpreted and applied Euro PSD2 rules and GDPR over and above CMA Mandates that included Swift ISO-20022 data compliance. \f"}, {"page_n": "2", "p_content": "PAUL VENABLES Tel: +44 (0)7957 109123 Email: paul.venables@olisof.co.uk LinkedIn: https://uk.linkedin.com/in/paul-venables-a253067 Lead Data Architect & SME, Tech Project Manager, BI and Analytics, Kimball DW Techniques ASSET MANAGEMENT, INVESTMENT BANKING, OPEN BANKING, PAYMENTS, INSURANCE, TELCO, FINTECH  Page | 2  § Policy Architecture for GDPR Consent and Authorisation Onward Provisioning etc.  § Provided standardised REST APIs using Swagger / JSON / XML / XQuery / XSLT / Swift / Altova / ISO-20022. Python Coding. Flask. § Data Model using Sparx EA, GEFEG.FX and Altova Spy XML. Web sequence diagrams. Agile delivery using Confluence / JIRA / GitHub. § Participant Directory in Salesforce and Security framework using OAUTH 2.0. Cloud infrastructure and development over AWS.  § Oracle database design and tuning queries using (Advanced Workload Repo) AWR and db statistics  § Considerable Stakeholder engagement with Barclays, HSBC, Lloyds, Nationwide, Danske etc. plus FinTechs and internal management. § Successfully delivered Stage 1 and 2 Open Data and Read / Write APIs in March 2017 and August 2017 respectively.  SWISS RE  ASSET MANAGEMENT LONDON / ZURICH / BRATISLAVA Lead Data Architect Consultant, BA, Tech PM - IHS Markit EDM SME, Kimball, Sql Server, Oracle All Asset Classes including FX, Equities, Futures, Options, Fixed Income, Solvency-II, Risk  May’15 – Sep’16 Lead buy side data architect, market and reference data architect and PM responsible for data solutions design, migrations, ETL, conceptual, logical and physical data modelling, governance, business analysis, UI design / analytics. Global Kimberlite EDM / MDM multi-asset data transformation programme. Equity, Fixed Income, Market Data and risk analytics focus. Consumption, ingest and analysis of Blackrock Aladdin Trade and Risk Analytics data, Bloomberg market data, Bloomberg Per Security, Back Office, Credit Ratings, Murex, OTC, FX, HiPort, EOD Pricing, data integration, security master etc.  • Data Migration from legacy Asset Control and Oracle Risk system to IHS Markit EDM / MDM / SQL Server solution. • Complex ETL / Data Pipelining / transformation analysis and Oracle SQL / PLSQL query tuning. Use of Kimball design techniques. • Roadmaps, business analysis, requirements gathering, Gap analysis, Conceptual / LDM / PDM data modelling using Power Designer • Hybrid usage of AWS Cloud for pipelining, S3 storage and some reference data marts.  • Operating across business domains and providing leadership. Power BI and Analytics Reporting. SQL Server T-SQL and DAX. • Defined the new master key structures for the organisation and the respective mappings of the business / natural keys from multiple heterogeneous systems. HSBC GLOBAL BANKING AND MARKETS Funds Data Provision Programme Market Data, IBOR/ABOR, Securities Trade Data Lead Enterprise Data Architect, Market Data and Licencing, SQL and Oracle11g  Post Trade Systems, Market Data, Markit EDM, SOA, Messaging, Modelling   Jul’13 – April 2015  Senior data architecture, programme leadership, Master Data Management MDM, data modelling (LDM/PDM) and BA services on the £12 million strategic HIS Markit EDM (Cadis) programme to create a new business data service hub to master FUND and TRADE data and publish to external client investment houses as well as internal HSBC consumer systems. This involved complex data integration of both client reference data and market data (Bloomberg /Reuters /Telekurs etc), Trade processing, Calypso derivatives, Linedata ICON and other Accounting & Valuation data. FATCA/Solvency-II.  ISO-20022 / Swift / XML / FPML data model and messaging alignment. Defined the master key strategy and transformation / mappings from input systems. Downstream systems included Cash Management, B-One, Performance, Charles River etc. Interfaced between Business, IT and Product Sponsors. Sql Server databases used. Devops FITNESSE and Jira Agile. IBM Websphere MQ Messaging infrastructure. • Produced key solution and data architecture documentation. Architectural governance and Reviews. Working Groups. • Produced logical and physical data models for Funds universe (LDM/PDM) using both SAP Power Designer and ERWIN • Aligned programme to ISO20022 data and reference XML data message standards for publishing and distribution  • Interfaced and led effort with IT/BA/QA/Market Data Vendors. Working groups/steering group sessions. • Created time series and SCD2 data model using Kimball best practice • Discussed and rationalised data licensing model directly with market data vendors including Bloomberg and Thomson Reuters • Messaging infrastructure specifications and data flows using IBM Websphere MQ • Key IHS Markit EDM design authority/architecture decisions including data bi-temporality, dimensional modelling and change history capture patterns. Explore DW and Big Data stack for strategic analytics and reporting. Tableau. • Advising and troubleshooting complex Markit EDM / MDM / Sql Server / Oracle solutions and transformations • Big Data Analytics using Oracle, Tableau and Apache Hadoop  XCHANGING INSURANCE SERVICES –  LLOYDS OF LONDON, LMA AND LIRMA  Strategy and Architecture Group Lead Kimball Datawarehouse and BI Architect / Tech PM DW, Integration, BI, Qlikview, MDM, Data Analytics, AWS Cloud, IAM Security Jul’10 – May 2013 A key figure in the Strategy and Architecture Design Authority group performing Architecture Reviews and creating data strategies/roadmaps. Also worked on two major programmes namely ECF2 and CRS (£8 million). The latter was successfully delivered to the Lloyds Syndicate Market using an Oracle / Qlikview web portal for public facing participant access. This provided claims performance metrics for the Market. The former incorporated the Claims Data Warehouse (CDW) where the author was key solution design authority, data architect and interim project manager which provided a portal for the Lloyds Syndicate Market, ILU and LIRMA members. CDW was a fully bi-temporal, performant data-warehouse achieved using Kimball methodologies and design patterns. The solutions used Oracle11g, Java, J2EE, DB2, IBM Infosphere MDM / CDC, Qlikview and SAP BOE portals. ACORD messaging.  I liaised with key Business Stakeholders, architecture teams and managed onshore/ offshore teams comprising up to 12 people.  • Produced conceptual/logical/physical data models (using Enterprise Architect/Erwin) plus Architecture and Solution Building Blocks documented according to TOGAF standards. • CRS programme, created data architecture strategy for Lloyds market claims analytics portal using Qlikview • CRS, completed full VM green-field infrastructure and IAM security architecture \f"}, {"page_n": "3", "p_content": "PAUL VENABLES Tel: +44 (0)7957 109123 Email: paul.venables@olisof.co.uk LinkedIn: https://uk.linkedin.com/in/paul-venables-a253067 Lead Data Architect & SME, Tech Project Manager, BI and Analytics, Kimball DW Techniques ASSET MANAGEMENT, INVESTMENT BANKING, OPEN BANKING, PAYMENTS, INSURANCE, TELCO, FINTECH  Page | 3  • CRS, managed product procurement and consultancy via direct Qlik vendor engagement.  • CRS, architected to meet strict performance SLAs thus avoiding penalties   • DATA GOVERNANCE, helped implement new TOGAF aligned enterprise data governance framework  • CDW programme, re-architected and turned round failing Oracle DW solution as part of ECF2 change programme  • Optimised the Change Data Capture and ETL processes to meet strict SLA using AWR, stats-pack, database statistics and SQL query plans • Target states, roadmaps, gap analysis, non-functional requirements • SWIFT Payments message format construction and transmission method – Netsett / ACORD • Project Manager for technical outsourcing agreement with Computer Science Corporation (CSC) • Part of data architecture design authority and programme steering plus client working groups • Complex web IAM security solutions design with DMZ and api abstraction • Migration of CRS Qlikview analytics solution to Amazon Web Services (AWS) cloud, Redshift • Prototype Cloudera Hadoop stack   CREDIT SUISSE VIA CONVERGENT CONSULTING ASSET MANAGEMENT (ZURICH/LONDON) Management Consultant, Data Manager, Oracle11g DW and BI Analytics  May’08 to May’2010 Global Asset Warehouse and Revenues Programme. Responsible for the overall architecture and subsequent management of the implementation of the Global Asset Warehouse (GAW). This involved multi-system data integration and the design of a highly-performant data warehouse and analytics solution using a proprietary Oracle11g data warehouse and OBIEE Hyperion OLAP stack with SqlServer2008. Other technologies used: Java, J2EE, C#, .Net • SOX compliant system using Global A&V and portfolio accounting feeds, FPML, XML • Star schema and Kimball data modelling patterns • Used for company-wide Regulatory and Performance metric reporting and self-serve analytics • Collective Investment Vehicles such as Funds, Portfolio Mandates and alternative investments, hedge funds etc. • All Client confidential data was anonymised to comply with worldwide legal and compliance data regulations. • Proprietary GUI for manual adjustments and reconciliation developed in C# and Dev Express. Key achievements • Produced RFP. RFT, audit of existing landscape and impact analysis of change transformation leading to tender win! • Proposed new information architecture to correct existing deficiencies in asset compliance and performance reporting • Leading a cross-border data security and compliance solution design • Designed for high performance including ETL and end-user querying/reporting layer. Tuned using Oracle query plans and stats. • Successfully led the effort to deliver a new system through all the lifecycles and finally into Production where it is currently well received FINMA Reporting BASEL II Project - Cross Border Financial Data Security Architecture. The author provided architectural consultancy regarding a Basel II global reporting solution using OBIEE and Oracle for both Private Banking and Investment Banking. In particular, the author architected a cross border data secrecy strategy.  ORCHESTRIA (NOW PART OF  CA) Financial Regulatory Compliance Solutions Senior Oracle and SQL Server Data Engineer   Jul’07 to May’08 Provided senior data and business consulting for Orchestria and their high-profile Investment Banking clients such as Goldman Sachs, HSBC, Merrill Lynch, UBS etc. Orchestria software helps corporations comply with Electronic Communications Policy Breach, Information Boundary, Data Loss Prevention, SOX and Federal Rules of Civil Procedure (FRCP) legal obligations amongst many others.  Key Achievements:  • Ported the new Orchestria module “Advanced Review Queue” (ARQ) from MSSQL2005 to Oracle11g whilst optimising the design and SQL code for maximum performance. • Consulted on issues for corporate clients like HSBC and Goldman Sachs • Produced proposal for new BI reporting option called “Advanced Reporting Option” (ARO) which is to be an optional module to the core Active Policy Management (APM) product. This is designed to alleviate poor performance in the core product and provide more flexibility for reporting, analytics and third-party OLAP BI tools.  • Proposed new data architecture roadmap exploiting Oracle and Warehouse Builder plus CDC Streams  UBS INVESTMENT BANK (LONDON/CITY) Regulatory Compliance, Fraud Insight, Data Mining DIRECTOR of Data Engineering – Oracle and BI Analytics       Jul’04 to Jul’07 Employed at Director level to oversee the data architecture of the messaging and communications Legal and Compliance solution used at UBS. Liaised with vendor Orchestria on APM-DLP (now CA Dataminder / DLP). Provided senior Data architecture and integration expertise by leading the team responsible for the Compliance and Regulatory systems across the UBS Investment Banking divisions. The systems were built in the four Global regions US, EMEA, APAC and Swiss using the Orchestria APM-DLP (now CA Data minder), Exchange and Autonomy Exchange Archive Solution (EAS) with large-scale multi-terabyte Oracle databases providing the on-line data management and EMC Centera WORM devices. Individual database tables contained billions of rows of data.  Key achievements:  • Planned and helped implement a complex Oracle data and application migration from V3 to V4 of Orchestria APM-DLP (now CA Dataminder / DLP) across all global regions in a limited timeframe.  \f"}, {"page_n": "4", "p_content": "PAUL VENABLES Tel: +44 (0)7957 109123 Email: paul.venables@olisof.co.uk LinkedIn: https://uk.linkedin.com/in/paul-venables-a253067 Lead Data Architect & SME, Tech Project Manager, BI and Analytics, Kimball DW Techniques ASSET MANAGEMENT, INVESTMENT BANKING, OPEN BANKING, PAYMENTS, INSURANCE, TELCO, FINTECH  Page | 4  • Led team of vendor and internal data analysts and engineers for over a year to port the data without ANY data loss.  • Designed Kimball solution around optimal data ingest and query performance using statistics, partitioning and index strategy • Helped resolve legal and compliance fraud case using Orchestria policy and data analysis • Led new Business Objects (BOXI) Reporting and Universe web portal initiative to provide compliance BI and data analytics   ROYAL MAIL PLC (City) Senior Web E-Commerce Engineer Oct’03 to May’04 Advised on E-Commerce PEARL and ATG CMS public web portal programme using Java, J2EE and Oracle. CRAWLEY BOROUGH COUNCIL Oracle Data Architect Jan’04 to Mar’04 Oracle CRM, Call Centre and Portal Project – Advise, train and mentor internal tech staff using Oracle E-Business ERM  and CRM suite. ORACLE CORPORATION Oracle Professional Services Associate Partner Sep’00 to Dec’03 Provided high end Oracle solutions, data architecture and tech PM consulting services for multiple corporate clients:  MIGROS – ERP / CRM AT FOOD RETAILER IN SWITZERLAND AND LONDON  SGS - BOSS ERP PROGRAMME HOLLAND AND GENEVA  SERONO – E-BUSINESS SUITE FINANCIALS PROJECT IN GENEVA UNILEVER - ROCKET PROJECT – WEB BASED FOOD PORTAL KIOSKS USING WORLDPAY PAYMENT SYSTEM  CAP GEMINI - ORACLE 11I E-BUSINESS SUITE – SSL SECURITY IMPLEMENTATION USING ORACLE  ROYAL AIR FORCE - ORACLE 11I EBS –ORACLE BALANCED SCORECARD ARCHITECTURE AND IMPLEMENTATION.  BT SYNTEGRA - SMALL BUSINESS SERVICES GATEWAY (SBS) WEB PORTAL PROGRAMME FOR GOVERNMENT MOTOROLA – ORACLE MANUFACTURING  UCL Oracle Consultant Jun’03 to Aug’03 MSD/FIS FINANCE PROJECT - Oracle 9iAS and Single Sign On OID + design/delivery of Financials Auto-Alerting system. MORSE CONSULTING (NOW PART OF DELOITTE) Data Architect Partner Apr’02 to Nov’02 VIZZAVI VODAFONE LIVE! PROJECT Consulted on Bea Weblogic, Vignette CMS, Oracle web portal project in UK and France. HP/BT CCBA DATA WAREHOUSE PROJECT Consulted on one of the UK’s biggest data warehouses at the time running to multi-terabytes. SGI (SILICON GRAPHICS INC)  SILICON VALLEY AND LONDON Senior Oracle Data Architect / BI and Data Warehouse Consultant Feb’1999 to Aug’01 Architected and implemented cutting edge Telco BI Data Warehouse and Data Mining Industry Solution (called TAP / BIST) using proprietary SGI Mining product over massively parallel Numa Unix infrastructures. COLT TELECOM GMBH (FRANKFURT) Senior Data Architect / Kimball /BI / DW Consultant May’98 to Oct 1998 HP TIMS Billing System Oracle data warehouse architecture. GE Oracle BI and Data Warehouse Consultant Oct’97 to May 1998 Designed data warehouse for GE Lighting division using Oracle and Business Objects.  DOW JONES MARKETS Market Data Systems Consultant Jun’97 to Oct 1997 Market Data Systems – Senior Oracle engineer on new market data system feed to provide better securities analysis.  HP Senior Oracle BI and Data Warehouse Consultant Oct’96 to May 1997 Telecoms data warehouse and analytics programmes across Europe. Massive relational databases tuned for performance. ORACLE CORPORATION Oracle Engineer Jul’93 to Sep 1996 Eurostar Passenger Trains solution and other database driven projects using Oracle, Proc*C and ERP.    \f"}, {"page_n": "5", "p_content": "PAUL VENABLES Tel: +44 (0)7957 109123 Email: paul.venables@olisof.co.uk LinkedIn: https://uk.linkedin.com/in/paul-venables-a253067 Lead Data Architect & SME, Tech Project Manager, BI and Analytics, Kimball DW Techniques ASSET MANAGEMENT, INVESTMENT BANKING, OPEN BANKING, PAYMENTS, INSURANCE, TELCO, FINTECH  Page | 5  EDUCATION KINGSTON UNIVERSITY BSc (Honours) Degree in Computer Science  TRURO BOYS INDEPENDENT SCHOOL 3 A-Levels in Maths, Physics and Chemistry  8 O-Levels in English, English Lit., Chemistry, Maths, Physics, French, Biology and Latin LANGUAGES • English (Native British) • French FLAW certificate (EEC Industry recognised French Language Course)  • Intermediate Spanish Speaking KEY SKILLS  • Information and Data Architecture. Enterprise and Solution Architecture. TOGAF, Archimate • Agile Project / Programme Management. Product Owner / Scrum Master. Business Analysis. Non-Functional Requirements. • Open Banking, Payments. Credit Cards. Account Info. ISO-20022, SWIFT, Retail Banking, Money Markets, WorldPay, Cash/FX,  • API, JSON, XML, FIX, REST, Microservices, ESB, MQ, Messaging SOA, JAVA, J2EE • AI, Machine Learning, Data Science. Python Programming. PySpark. Flask. Matlab, Octave • Master Data Management, MDM, EDM, Big Data, Data Lake, Markit EDM  • Regulatory and Risk Compliance, SOX, Solvency-II, FATCA, Market Data, Basel-II, MIFID-II, EMIR, PSD2, CMA, FCA  • Bloomberg per Security, Bloomberg AIM, Bloomberg Port, Blackrock Aladdin, Order Management systems, Risk , OMS, ThinkFolio, Reference Data, FPML, IBM Websphere MQ, Infosphere, IAM,  • Data warehousing, dimensional design, Kimball patterns, ODS / Data Mart, Data Mining, in-memory databases, Complex data integration, ETL, AB Initio, Metadata hub • Conceptual , Logical , Physical Data Model , Power Designer, ERWIN, Sparx Enterprise Architect, UML • BI and Analytics, Qlikview / Tableau, Visualisation Tools, Tableau, SAP BOE / BOXI / BODS, Informatica, OBIEE, Hyperion  • Very strong Oracle and SQL Server stacks, PL-SQL, T-SQL, SQL, MySQL, NOSQL, AWR, Statistics, Query and DML Performance Tuning • Linux, Cloudera, Hadoop, Hive, HBase, Cloud, AWS, Azure, IaaS, SaaS, Fitnesse, Devops, Atlassian, Confluence, Jira, GIT, GitHubAPI, JSON, Microservices, GDPR, PSD2, AWS, Aurora, Redshift, S3 \f"}]}