{"filename": "devops-cv3", "pages": [{"page_n": "1", "p_content": "Agency_X_TEST Mohamed Zhin – El-Fake-Cv-Name  Profile summary  • An accomplished senior leader with extensive experience in software engineering in Agile IT environments, specialising in machine learning, Cloud, data science, and full solution development.  • Assembles, develops, and leads high-performance technical teams and project delivery, overseeing deliverables through to successful conclusion, including automation on Cloud-based platforms, adopting a hands-on/hands-off management approach.  • Consistently focused on the customer/end-users, applying depth of knowledge in the use of various languages, methodologies, databases, and system integration.  • Confidently identifies problems and issues, sourcing appropriate and scalable solutions, ensuring best practice and quality standards.    Education  BSc Higher Education Applied Mathematics & Theoretical Physics    2013 Coventry University  Technical skills  • C#, .Net Framework, .Net Core, Entity Framework Core  • Angular, Node.js, JavaScript, Typescript  • Azure Data Factory, Azure Data Warehouse  • Serverless Functions  • BigQuery, GCP Data Tools  • Spark, Kafka, Hive, Google Cloud Platform, AWS Elastic MapReduce, AWS SageMaker, AWS Lambda Functions, AWS S3 • Terraform  • Python, TensorFlow, Spacy, NumPy, SciPy, Pandas, Neural Networks  • Docker, Kubernetes  • Splunk, Mixpanel  • Elasticsearch, Kibana  • SQL, NOSQL, MongoDB, Azure Cosmos DB, DynamoDB, Azure SQL Server, SQLite   Work experience  Data2Decisions Ltd             Sep 2019 – Present Head of Platform Engineering  • Led and managed a multi-disciplinary, geographically dispersed team to deliver 5 projects, consisting of Software Developers, DevOps Engineers, Data Engineers, Data Scientists and QA Engineering  • Designed and implemented technical architecture and cloud design for most cost efficient and scalable ETL pipelines. These pipelines enabled us to serve our clients at scale and at speed • Deploying machine learning models on the cloud (Azure & GCP). • Data Engineering using Azure data tools and Google BigQuery. • Controlled and monitored budgets, managed technical and commercial project schedules and assessed business requirements/inefficiencies to optimised and automate with technology  • Created machine learning models-based automated bid optimisation tool for Google Search Ads and Display Banner Ads using PySpark running on AWS EMR, EC2, Lambda Functions, S3, Kinesis and Google BigQuery. This allows media agencies to have less people doing manual tasks and efficiently and scientifically optimises better than manual control • Managed development roadmaps and collaborated with key stakeholders regularly to assess issues and mitigate/eliminate risks  \f"}, {"page_n": "2", "p_content": "Agency_X_TEST • Applied machine learning algorithms on big data. Used Google Analytics data and CRM data to create user journeys to produce a score of important user journey touchpoints for ecommerce sites using AWS Compute tools and Google data tools  Fuel3D Technologies Ltd                                        Jan 2019 – Aug 2019 Lead Full Stack Engineer/Technical Architect  • Built automated CI/CD pipelines to deploy backend, frontend and data pipelines, saved countless hours of manual deployments. • Created and deployed 5 computer vision machine learning models on Azure. These provided a 30% increase in accuracy over traditional C++ imaging engines. These were written in Python using TensorFlow and deployed as a container each.  • Explored cheaper, reliable and productive Azure services and implemented them. I broke down a bloated Azure Service Fabric solution to small, manageable, easily updatable, microservice-based, dockerised solutions. This allowed us to release updates frequently and seamlessly. • Created data pipelines using python and deployed the containerised version to Azure. This was a cheaper and more customisable option than using Azure Data Factory. This saved over £1500 per month. • Wrote serverless code on Azure functions using C#. For small independent tasks, this proved effective. • Scripted ARM templates for managing resources on Azure. This was much faster to manage infrastructure.  • Set up Kubernetes on Azure and deploying containers to K8s pods. Deployments are seamless as Kubernetes manage sending traffic to the most updated pods. • Created full solution architecture for a scalable solution with cost kept low. Saved over £10k every month.  • Interviewed, onboarded and mentored new software engineers. • Evaluated cloud providers including AWS and GCP for serving machine learning models.  • Established high standards on source control such as code reviews on pull requests on Git. This prevents countless bugs being pushed to production. • Streamlining our overall cloud usage to using Azure and transferred files and hosted apps from AWS S3 and EC2 to Azure Blob Storage and Azure App Service. Once complete, it cut the cost of £7k per month. • Wrote CPU-throttling, multi-threaded, automated regression tests to test C++ imaging engines to the core. These tests proved very effective to benchmark the performance of complex imaging engines. • Evaluated Azure Data Factory and created multiple data pipelines. It was a very rapid way to create data pipelines. • Wrote complex SQL queries, views and stored procedures in association with data pipelines and data staging process. • Set up Splunk, Mixpanel and Azure Application Insights for user journeys, apps telematics and error reporting.    Technologies Used:  .Net Core 2, Angular, Azure SQL Server, Azure Blob Storage, Azure Traffic Manager, Azure Data Factory, Azure Container Service, Azure Service Fabric, Azure App Service, Azure Functions, Azure Data Warehouse, Azure Application Insights, Terraform, ARM Templates, Python, TensorFlow, Node.js, Entity Framework, Docker, Kubernetes, Splunk and Mixpanel  Carnell Support Services                                         Mar 2018 – Jan 2019 Full Stack Developer/Data Scientist   • Created diverse applications and tools to support company projects, including development of Single Page Applications (SPAs) and deployment of business applications on Azure app service • Led the design of computer vision machine learning models, end-to-end solutions and data architecture for Internet of Things (IoT) devices network and tools to capture and transfer data for ML in Clod and edge computing environments  \f"}, {"page_n": "3", "p_content": "Agency_X_TEST • Supported a range of projects, including a timesheet application, replacing Excel-based system with microservice –based web apps and creating machine learning models with predictive tools to forecast flooding hotspots on UK motorways using drainage and historical rain/flood index data   Cadlogic Ltd                        Nov 2017 to Feb 2018  Software Engineer  • Translated encryption and software validation code from VB.Net to C#. • Developed GUI. • Worked on developing a CAD windows-based desktop application for building steel sheds on Microsoft Visual Studio 2013/2017 using WinForms.  • Used MVC model to keep model and views separate and saved the model as an encrypted and compressed XML file.  • Created 2D and 3D geometry from scratch in C# and modelled using Teigha. • Created databases of building products. • Created unit tests for validation purposes. • All projects were based on the Scrum methodology in the Agile framework.   Sutton Carter Investments Ltd                         Jul 2016 to Oct 2017  Database Manager/Data Engineer  Achievements and responsibilities:  • Captured business requirements to design database schemas. • Designed and developed in-house databases using Microsoft Access and Microsoft SQL Server. • Developed reporting suite. • Maintained the database. • Maintaining different databases for different needs.   Absolute Interpreting & Translations Ltd                     July 2013 to July 2016  Medical Interpreter  Areas of expertise  • Cloud Architecture Development      • Machine Learning & Big Data   • Data Engineering   • Technical Team Leadership      • Technical Project Delivery    • Design Architecture  • Software Development & Engineering   • Stakeholder Management   • Hands-on Development  • Cloud & Web App Security      • Negotiation & Influence    • Process Automation   • Scalable Technology Solutions     • Team Assembly & Development    • Problem & Issue Resolution     • Cloud-Based Systems   • Risk Mitigation & Management   • CD & CD Pipelines • Cost Optimisation & Efficiencies   • Commercial Model Development   • Technical Interpretation      \f"}, {"page_n": "4", "p_content": "Agency_X_TEST Personal projects  OCR for Urdu using Convolutional Neural Networks         2018 – 2019 • I created an algorithm that produces a very large labelled dataset. I created 1000 images per word. There were 140,000 words. The algorithm allows me to easily scale and create as much images as necessary. I wrote a simple CNN (Convolutional Neural Network) to recognise the images. The CNN was thus, trained on computer generated data. However, I verified that it can even recognise hand-written words. This shows that, one, deep learning is powerful enough to be trained on computer generated data and recognise real world objects and, two, even simple CNN architecture proved fruitful in this endeavour.  Training a robotic arm using Reinforcement Learning                                  2018 • I am working on a project where I apply Augmented Random Search (ARS) algorithm (a reinforcement learning algorithm) to a robotic arm. This algorithm along with an object recognition algorithm using OpenCV is used to pick up objects and place them elsewhere. There is a lot of room for improvement in this system        \f"}]}